E1mpire/HelloMaker-STM32/User/main.cpp
		 #elif SBUS_EN
			 #if FUTABA
	         if(f_bias > 1200) f_bias = 1000;
				 else if(f_bias < 800) b_bias = 1000;
				 if(f_bias > 1000)
				  { 	
					FR_scale = dl_map(1200-f_bias,0,200,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 1000)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-800,0,200,BIAS_SACLE,1.0);			   
				  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(f_bias > 1800) f_bias = 992;
				 else if(f_bias < 200) b_bias = 992;
				 if(f_bias > 992)
				  { 	
					FR_scale = dl_map(1712-f_bias,0,720,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 992)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-272,0,720,BIAS_SACLE,1.0);			   
				  } 
			 #endif
		 #endif
			
	}
     if( BackAdjust == 0)
	  {
		STMFLASH_Read(READ_BACK_ADDR,(u16*)DataAddress,SIZE);
		b_bias = DataAddress[0];

		#if IBUS_EN
			if(b_bias > 2000) b_bias = 1500;
			else if(b_bias < 1000) b_bias = 1500;
			if(b_bias > 1500)
			  { 	
				BR_scale = dl_map(2000-b_bias,0,500,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1500)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-1000,0,500,BIAS_SACLE,1.0);	   
			  }   
		 #elif SBUS_EN

		     #if FUTABA
	         if(b_bias > 1200) b_bias = 1000;
			 else if(b_bias < 800) b_bias = 1000;
			 if(b_bias > 1000)
			  { 	
				BR_scale = dl_map(1200-b_bias,0,200,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1000)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-800,0,200,BIAS_SACLE,1.0);	   
			  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(b_bias > 1800) b_bias = 992;
			 else if(b_bias < 200) b_bias = 992;
			 if(b_bias > 992)
			  { 	
				BR_scale = dl_map(1712-b_bias,0,720,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 992)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-272,0,720,BIAS_SACLE,1.0);	   
			  } 
			 #endif
		 #endif
	  }
}

#endif

#if SERVO_EN
void TaskTimeHandle(void)
  {
	static uint32 time = 20;
	if(gSystemTickCount > time)
	  {
		  time += 20;
		  ServoPwmDutyCompare();		
	  }
   }
#endif
/*
----------------------------------------------------------------------------------
以下为自己写的函数
*/

// 调节系数定义
float FHspeed_Scale=0.99025;
float FLspeed_Scale=0.99045;
float BHspeed_Scale=0.970;
float BLspeed_Scale=0.99;
// 高速和低速的基准pwm值
int highspeed = 200;
int lowspeed = 100;

int pwm_y1;
int pwm_y2;
int pwm_x1;
int pwm_x2;
	
void Highspeed_Forward()
{
	// 往右偏，左轮太快
	pwm_y1 = highspeed*FHspeed_Scale;
	pwm_y2 = highspeed;
	motor1.spin(pwm_y1);   //左轮
	motor2.spin(-pwm_y2);   //右轮，电机接受的值与左轮相反

}
		

void Lowspeed_Forward()
{
	//往右偏，左轮太快
	pwm_y1 = lowspeed*FLspeed_Scale;
	pwm_y2 = lowspeed;
	motor1.spin(pwm_y1);   //左轮
	motor2.spin(-pwm_y2);   //右轮，电机接受的值与左轮相反

}
void Highspeed_Backrward()
{
	// 往左偏，右轮过快
	pwm_y1 = highspeed;
	pwm_y2 = highspeed*BHspeed_Scale;
	motor1.spin(-pwm_y1);   //左轮
	motor2.spin(pwm_y2);   //右轮，电机接受的值与左轮相反
}

void Lowspeed_Backrward() //停止
{
	pwm_y1 = lowspeed;
	pwm_y2 = lowspeed*BLspeed_Scale;
	motor1.spin(pwm_y1);   //左轮
	motor2.spin(-pwm_y2);   //右轮，电机接受的值与左轮相反
}
void Left()
{
	Motor_run(-60,80);
}
void Right()  //右转
{
	Motor_run(60,80);
}
void Stop()
{
	motor1.spin(0);
	motor2.spin(0);
}
	



/*---------------------------------------------------------------------------*/
int main(void) 
{

	
	// 开关
	bool OnOff = false;
	// 分配内存
    char buffer[50];
	// 初始化时间，包括速度、led、电机等 
    uint32_t publish_vel_time = 0;
	uint32_t previous_imu_time = 0;
	uint32_t previous_oled_time = 0;
	uint32_t previous_led_time = 0;
    uint32_t previous_debug_time = 0;
	uint32_t previous_motorprotec_time = 0;
	uint32_t previous_control_time = 0;
	uint32_t previous_battery_debug_time = 0;
	// 电量不足预告
	char battery_buffer[]= "The voltage is lower than 11.3V,Please charge! ";

	// 系统初始化，包括系统、四个电机，编码器，led以及GPIO
	SystemInit();
	initialise();
	motor1.init();
	motor2.init();
	motor3.init();
	motor4.init();
	motor1.spin(0);
	motor2.spin(0);
	motor3.spin(0);
	motor4.spin(0);
	encoder1.init();
	encoder2.init();
	led.init();
	bat.init();
	#if RELAY_EN
	SwitchGpioInit();
   // Switch(0,FALSE);
	#endif
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,ENABLE);	  
	//-------JTAG------
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);
    #if OLED_EN
	OLED_Init();
	OLED_ShowCHinese(0+50,  0, 6,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(18+50, 0, 7,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(36+50, 0, 10, CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(54+50, 0, 11, CNSizeWidth,  CNSizeHeight);

	OLED_ShowCHinese(0+50,  2, 4,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(18+50, 2, 5,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(36+50, 2, 10, CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(54+50, 2, 11, CNSizeWidth,  CNSizeHeight);
	
    OLED_ShowCHinese(0+50,  4, 8,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(18+50, 4, 9,  CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(36+50, 4, 10, CNSizeWidth,  CNSizeHeight);
	OLED_ShowCHinese(54+50, 4, 11, CNSizeWidth,  CNSizeHeight);
    #if TILT_DETEC
		OLED_ShowCHinese(0+50,  6, 12,  CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(18+50, 6, 13,  CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(36+50, 6, 14, CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(54+50, 6, 15, CNSizeWidth,  CNSizeHeight);
	#else
	    OLED_ShowCHinese(0+50,  6, 16,  CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(18+50, 6, 17,  CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(36+50, 6, 18, CNSizeWidth,  CNSizeHeight);
		OLED_ShowCHinese(54+50, 6, 19, CNSizeWidth,  CNSizeHeight);
		CtrModeShow();
	#endif
	#endif
	#if SERVO_EN
	InitPWM();
    InitTimer6();
	#endif

	// 设置Serial口的波特率
	SerialPrint.begin(115200);
	dlProtocol.begin();
	drv_uart_init(9600);  //LoRa串口初始化

    #if IBUS_EN
    SerialBus.begin(115200);
    IBus.begin();

	#elif SBUS_EN
    sBus.begin();// SBUS初始化

	#elif PWM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	TIM2_Cap_Init(0xFFFF,72-1);
	#elif PPM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	#endif
    #if BIAS_ADJUST 
    Bias_check();  //偏差值初始化
	#endif
	// led开关
	led.on_off(OnOff);




