E1mpire/HelloMaker-STM32/User/main.cpp
	/*-------------------------------以上都是初始化------------------------------------------*/
	// 主循环
	#if 1
	while(1)
	{
		if((millis()-previous_LoRa_time)>=20)
	   {
		/*
		*LoRa通信模块，用来接收传输的控制信息
		*/
		RxLength = drv_uart_rx_bytes(LoRa_buffer);
		if (RxLength =! 0)
		{
			drv_uart_tx_bytes((uint8_t *)LoRa_buffer, RxLength);
			for(int i=0; i<8; i++)	
			{	
				// 如果不是某条信息，那么符号位变为1，不再比较
				if (LoRa_buffer[i]!=Remote_on[i] && Remote_on_flag!= 1)  Remote_on_flag = 1;
				if (LoRa_buffer[i]!=Remote_off[i] && Remote_off_flag!= 1)  Remote_off_flag = 1;

			}
			if (Remote_off_flag==1&&Remote_on_flag==1)
			{
				Remote_off_flag = 0;
				Remote_on_flag = 0;
			}
			else if (Remote_on_flag==0)
			{
				REMOTE_CONTROL_FLAG = 1; //进入遥控模式

				Remote_off_flag = 0; //刷新符号位
			}
			else if (Remote_off_flag==0)
			{
				REMOTE_CONTROL_FLAG = 0;//退出遥控模式
				Remote_on_flag = 0;
			}
			
		
		}
	   }
	   
       #if (CONNECT_DETEC)
       if ((millis() - previous_command_time) >= 250 && REMOTE_CONTROL_FLAG){  
		/*
		/PC运动模块运行250ms后刷新，即5次后清空PC_ThrottleControl参数
		*/
		      if(b_rc_idle == true)  stop_base();
         }
	   #endif
        if((millis() - previous_flysky_time) >= (1000 / IBUS_RATE) && REMOTE_CONTROL_FLAG)
        	{
			/*
			*遥控器模块，每1000/40=25ms执行一次，运行遥控器控制
			*/   
        	  #if IBUS_EN
              ibus_control();     
			  #elif SBUS_EN
			  sbus_control();	
			  #elif PWM_EN
              pwm_control();
			  #elif PPM_EN
			  ppm_control();
              #endif
              previous_flysky_time = millis();				  
		    } 


		if ((millis() - previous_control_time) >= (1000 / COMMAND_RATE)&& !REMOTE_CONTROL_FLAG)
		{
			/*
			*程序控制模块，当不使用遥控器控制时
			*/
			Highspeed_Backrward();
			delay(5000);
			Stop();
			delay(5000);
			previous_control_time = millis();
		}


		#if 1
        if((millis() - previous_movebase_time) >= (1000 / MOVEBASE_RATE))
        	{
			/*
			*速度模块,如果有编码器将进行平滑速度控制，每1000/40=25ms获取一次速度
			*/   
               getVelocities();
               previous_movebase_time = millis();	  
		    }
		#endif

	    #if TILT_DETEC 
        if ((millis() - previous_imu_time) >= (1000 / IMU_PUBLISH_RATE)){
            if(!imu_is_initialized)
				{
	                imu_is_initialized = initIMU();
	                if(imu_is_initialized){
	                   
	                }else{
	     
	                }          
                }
			else{
                   
		         TiltAlarm();
            }
                previous_imu_time = millis();
			
           }
		 #endif

		 #if OLED_EN
		 
		 if((millis() - previous_oled_time) >= (1000 / OLED_RATE)&& REMOTE_CONTROL_FLAG){
			/*
			*OLED模块，，遥控器使用时启动每1000/50=20ms在屏幕上更新运动数据
			*/ 
			    static int count ,fresh,num;
                if(fresh++ >= 20)
				  {
			          fresh = 0;
					  #if TILT_DETEC
					  OLED_ShowNumber(0, 0, (int)pitch,2,16);
					  #endif
					  OLED_ShowNumber(0, 48, PulsewidthX,4,16);
					  OLED_ShowNumber(0, 32, PulsewidthY,4,16);
					  #if SBUS_EN || IBUS_EN || PPM_EN
					  OLED_ShowNumber(0, 16, Pulsewidth_Power,4,16);
					  #endif
			          OLED_Refresh_Gram();
				  }
				 previous_oled_time = millis();
			
			
			
			}
			else if ((millis() - previous_oled_time) >= (1000 / OLED_RATE)&& !REMOTE_CONTROL_FLAG)
			{
				// 脱离遥控器控制时的OLED屏幕，暂且空着
				previous_oled_time = millis();
			}
			
			

         #endif
         if((millis() - previous_led_time) >= (1000 / LED_RATE)){
            /*
			*LED模块，每1000/10=100ms执行一次，控制LED闪烁
			*/   
			    static bool blink = false, start_blink = true;
                if((PulsewidthX == 0  || PulsewidthY == 0) &&  PC_start == false)//PC不连接且电机不动时闪烁
				  {   
				      blink = !blink;
                      led.on_off(blink);		 
				  }
				 else if(start_blink == true){   //否则强制关闭LED
                         start_blink = false;
                         led.on_off(false);
         
				 }
				 previous_led_time = millis();
			}
         if(DEBUG)
		   {
	         if ((millis() - previous_debug_time) >= (1000 / DEBUG_RATE)) {
				/*
				*偏差修正模块，将偏差值信息存储及输出并进行偏差调整，每1000/10=100ms执行一次
				*/						 
			     print_debug();
			     #if BIAS_ADJUST
				 BiasAdjst();
				 BiasadjustSave();
				 #endif
				 previous_debug_time = millis();
	            }
	        } 
          #if 1
		  if(DECORDE_EN)
		   {
	         if ((millis() - previous_motorprotec_time) >= (1000 / MOTORPROTEC_RATE)) {						 
			    /*
				*电机保护模块，如果当前电机一直不动且输入的脉宽很大的情况维持10次则强制停止电机 
				*/
				  if((current_rpm1 == 0 && abs(pwm1) >= 240)||( current_rpm2 == 0 && abs(pwm2) >= 240)) i++;
			      else i = 0;
				  if(i >= 10) UrgencyStop = true;
				  else UrgencyStop = false;
				  if(UrgencyStop == true)  g_forcestop = true;
				   previous_motorprotec_time = millis();
	            }
	        } 
		  #endif
		


         
	 }
    #endif
   }

